import back1 from '../assets/images/back/1.jpg';
import back2 from '../assets/images/back/2.jpg';
import back3 from '../assets/images/back/3.webp';

import press1 from '../assets/images/press/1.jpg';
import press2 from '../assets/images/press/2.jpg';
import press3 from '../assets/images/press/3.jpg';

import chest1 from '../assets/images/chest/1.jpg';
import chest2 from '../assets/images/chest/2.jpg';
import chest3 from '../assets/images/chest/3.jpg';

import arms1 from '../assets/images/arms/1.jpg';
import arms2 from '../assets/images/arms/2.jpg';
import arms3 from '../assets/images/arms/3.jpg';

import legs1 from '../assets/images/legs/1.jpg';
import legs2 from '../assets/images/legs/2.jpg';
import legs3 from '../assets/images/legs/3.jpg';

export const data = {
  exercises: {
    back: [
      {
        id: 1,
        title: 'Планка',
        img: back1,
        text: '- Примите исходное положение. \n- Согните руки в локтях, положите их на пол и обопритесь на предплечья. \n- Для усложнения упражнения можно поднять одну ногу или руку и держать её параллельно полу. \n- Можно соединить планку на локтях и руках, поочередно меняя положения – переходя из планки на руках в планку на локти и обратно, сгибая и разгибая руки.',
      },
      {
        id: 2,
        title: 'Подъем конечностей на четвереньках',
        img: back2,
        text: '- Встаньте на четвереньки. \n- Руки расположите на ширине плеч прямо под плечами. \n- Слегка согните руки в локтях, колени находятся под бедрами. \n- Туловище параллельно полу. \n- Тело образует прямую линию от головы до ягодиц. \n- Вытяните правую руку вперед, а левую ногу назад, сохраняя при этом прямую спину. \n- Удерживайте это положение от двух до десяти секунд, а после верните конечности в исходное положение. \n- Повторите упражнение с другой рукой и ногой, а общее количество повторов должно быть от 8 до 12.',
      },
      {
        id: 3,
        title: 'Лодочка',
        img: back3,
        text: '- Исходное положение имеет огромное значение. Поясница плотно прижимается к полу. \n- Мышцы пресса и кора напряжены. Руки вытянуты, словно стрелы. Пятки и носки прижаты друг к другу. \n- Сделайте глубокий вдох. Диафрагма максимально расширена, живот втянут. \n- Оптимальная высота подъема ног и рук – 30-40 см. Таз, поясница и лопатки не отрываются от пола. Поднимаются только ноги и плечи. \n- Задержите дыхание и посчитайте до 8-10. \n- Опустите ноги и руки на пол, максимально расслабьте все тело.',
      },
    ],
    сhest: [
      {
        id: 4,
        title: 'Отжимания',
        img: chest1,
        text: '- Опуститься вниз, сгибая руки в локтевых суставах, продолжая удерживать лопатки в этом положении и сохраняя анатомически правильные изгибы позвоночника. \n- Локти направлены примерно под углом 45-50 градусов от туловища. \n- Затем плавно вернуться в исходное положение.',
      },
      {
        id: 5,
        title: 'Проработка трицепсов и мышц груди на брусьях',
        img: chest2,
        text: '- Обхватите брусья с внешней стороны ладонями вниз. \n- Выпрямите руки, слегка разведите локти в стороны и наклоните тело вперед на 30 градусов. \n- На вдохе опускайте туловище, сгибая локти под 90 градусов. \n- На выдохе поднимитесь в исходную позицию и зафиксируйтесь на пару секунд в верхней точке.',
      },
      {
        id: 6,
        title: 'Подтягивание на турнике обратным хватом',
        img: chest3,
        text: '- Чтобы тренировка груди на турнике была эффективнее, желательно подтягиваться средним хватом. \n- Плавно поднимайте тело, немного отклоняясь назад до момента касания груди с турником, а потом медленно спуститесь.',
      },
    ],
    arms: [
      {
        id: 7,
        title: 'Концентрированные подъёмы на бицепс',
        img: arms1,
        text: '- Сядьте на лавку, возьмите в руку гантель. \n- Прижмите плечо к внутренней стороне бедра. \n- Сгибайте локоть, поднимая гантель, и опускайте обратно. \n- Выполняйте движение плавно и под контролем, старайтесь двигать рукой в полной амплитуде: сгибать до конца и полностью разгибать.',
      },
      {
        id: 8,
        title: 'Подъёмы гантелей на наклонной скамье',
        img: arms2,
        text: '- Сядьте на наклонную скамью с гантелями в руках, прижмите тело к спинке, стопы — к полу. \n- Опустите руки, чтобы они свободно свисали вниз, а локти находились за линией тела. \n- Согните руки с гантелями, затем плавно и под контролем верните в исходное положение и повторите.',
      },
      {
        id: 9,
        title: 'Подъём штанги или гантелей на бицепс',
        img: arms3,
        text: '- Возьмите штангу обратным хватом, согните локти и поднимите её до уровня плеч. \n- Опустите обратно и повторите. \n- Следите, чтобы двигались только руки, а остальное тело оставалось статичным: никакой раскачки быть не должно. \n- Такое же упражнение можно делать с гантелями. В крайней точке разворачивайте руки пальцами к себе.',
      },
    ],
    press: [
      {
        id: 10,
        title: 'Складка к ногам',
        img: press1,
        text: '- Лягте на спину, поднимите ноги и руки под прямым углом. \n- Оторвите от пола плечи и таз, дотроньтесь кончиками пальцев до стоп. \n- Медленно опуститесь обратно на пол. \n- Повторите 20 раз.',
      },
      {
        id: 11,
        title: 'Ножницы',
        img: press2,
        text: '- Лягте на спину, тяните пупок к позвоночнику и прижимайте поясницу к полу. \n- Поднимите вверх обе ноги до угла в 45 градусов, вытяните носочки. \n- Начните медленно скрещивать ноги. Выполните 10–15 повторений на каждую.',
      },
      {
        id: 12,
        title: 'Скручивания лягушкой',
        img: press3,
        text: '- Сядьте на пол, вес расположите на седалищных костях. Подайте назад спину, чтобы удержать равновесие, согните колени и оторвите от пола стопы. \n- Выдохните, подтяните пупок к позвоночнику и откиньтесь назад, раскрывая руки и выпрямляя ноги. \n- Со вдохом вернитесь в исходное положение с коленями у груди. \n- Повторите 20 раз.',
      },
    ],
    legs: [
      {
        id: 13,
        title: 'Ягодичный мостик на одной ноге',
        img: legs1,
        text: '- Это одно из лучших движений на прокачку задней стороны бедра. \n- Лягте на спину, согните колени и поставьте стопы на пол. \n- Оторвите одну ногу от пола и выпрямите её — это исходное положение. \n- Затем сожмите ягодицы и поднимите таз как можно выше. \n- Вернитесь в исходное положение и повторите. \n- Чтобы усложнить движение, поставьте опорную ногу на небольшое возвышение, например на край дивана. \n- Ещё можно подвинуть опорную ногу дальше от таза — это также увеличит нагрузку.',
      },
      {
        id: 14,
        title: 'Болгарские сплит‑приседания',
        img: legs2,
        text: '- Движение прекрасно прокачивает переднюю сторону бедра и обеспечивает хорошую нагрузку на ягодицы. \n- Встаньте спиной к стулу или другой невысокой опоре и положите на неё носок одной ноги. \n- Руки можете убрать на пояс или сложить перед грудью — как удобнее. \n- Присядьте до параллели бедра опорной ноги с полом. \n- Если пятка при этом отрывается, чуть отодвиньтесь от опоры. \n- На выходе из приседания следите, чтобы колено не заворачивалось внутрь.',
      },
      {
        id: 15,
        title: 'Подъём на носочек',
        img: legs3,
        text: '- Это движение прокачивает икроножные мышцы. \n- Поднимайтесь на носочки и опускайтесь обратно. \n- Если чувствуете себя неуверенно, можете придерживаться за какую‑нибудь опору. \n- Чтобы увеличить нагрузку на мышцы, поставьте подушечку стопы на возвышение и опускайте пятку до пола, прежде чем поднять её. Это увеличит диапазон движения и нагрузку на икры. \n- Также вы можете усложнить это и другие движения с помощью покупных или самодельных компактных снарядов для тренировки.',
      },
    ],
  },
};
